Revit 2026 API

# BuiltInFailuresDebugTabBindingFailures Class

---

Failures related to binding framework demo panel on Ribbon Debug Tab.

SystemObject Autodesk.Revit.DBBuiltInFailuresDebugTabBindingFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DebugTabBindingFailures
```
```vb
Public NotInheritable Class DebugTabBindingFailures
```
```cpp
public ref class DebugTabBindingFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DebugTabBindingFailures = class end
```

The BuiltInFailuresDebugTabBindingFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OptionValueOutOfRange | Value out of range for Options enum. |

#### Reference

Autodesk.Revit.DB Namespace